## Plan Result (test_apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * module.api-mgmt.azurerm_api_management_logger.apim
  * module.api-mgmt.module.application_insights.azurerm_application_insights.this
* Move
  * module.api-mgmt.azurerm_application_insights.apim => module.api-mgmt.module.application_insights.azurerm_application_insights.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.azurerm_api_management_logger.apim must be replaced
-/+ resource "azurerm_api_management_logger" "apim" {
      ~ id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-test/loggers/cft-api-mgmt-test-logger" -> (known after apply)
        name                = "cft-api-mgmt-test-logger"
      ~ resource_id         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Insights/components/cft-api-mgmt-test" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      ~ application_insights {
          ~ instrumentation_key = (sensitive value)
        }
    }

  # module.api-mgmt.module.application_insights.azurerm_application_insights.this must be replaced
  # (moved from module.api-mgmt.azurerm_application_insights.apim)
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "28bf3a45-7abd-4023-ad8c-69f1a240115e" -> (known after apply)
      ~ application_type                      = "other" -> "web" # forces replacement
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Insights/components/cft-api-mgmt-test" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "cft-api-mgmt-test" -> "cft-api-mgmt-perftest" # forces replacement
      ~ retention_in_days                     = 30 -> 90
        tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1933,"Program":"tfcmt","SHA1":"","Target":"test_apim","Vars":{}} -->